{
  "lecture": {
    "order": 1,
    "slug": "variables",
    "title": "Переменные",
    "description": "Вы можете использовать язык программирования, такой как Python, для выполнения вычислений или работы с постоянными значениями, такими как строки. Однако достаточно ли этого для вас? При написании реальных программ обычно требуется хранить значения или результаты оценки в памяти компьютера.",
    "isAvailable": true,
    "sections": [
      {
        "order": 1,
        "title": "Что такое переменная",
        "body": "<p>Переменная — это именованное место, где вы можете сохранить значение для последующего доступа к нему. Представьте себе коробку, в которой вы что-то храните. Это переменная.</p><p>Например, вы вычисляете результат и хотите повторно использовать этот результат в другом месте. В этом случае вы можете использовать такой ящик для экономии времени.</p><p>Как правило, рекомендуется давать переменной имя, описывающее ее содержимое.</p>"
      },
      {
        "order": 2,
        "title": "Определение переменной и присвоение значений",
        "body": "<p>Вы можете хранить в переменных почти все, что угодно, присваивая значение именованной переменной со знаком равенства. Согласно PEP 8, один пробел до и после знака присваивания считается хорошей практикой.</p><div><pre>day_of_week = 'Monday'</pre></div><p>Теперь у вас есть строковое значение «Monday», хранящееся в памяти компьютера. Вы можете получить значение, вызвав имя переменной.</p><div><pre>print(day_of_week)  # Monday</pre></div><p>day_of_week хранит значение типа str.</p><div><pre>print(type(day_of_week))  # <class 'str'></pre></div><p>Вы всегда можете присвоить новое значение определенной переменной.</p><div><pre>day_of_week = 'Tuesday'</pre></div><p>Теперь вы получите другое значение:</p><div><pre>print(day_of_week)  # Tuesday</pre></div><p>Можно присвоить значение одной переменной другой переменной:</p><div><pre>a = 10<br>b = a  # b is 10</pre></div><p>Если вы не определили переменную в рамках своего кода, вы увидите ошибку при попытке ее использовать:</p>"
      },
      {
        "order": 3,
        "title": "Правила именнования переменных",
        "body": "<p>Как упоминалось выше, каждая переменная имеет имя, которое отличает ее от других переменных. Есть несколько правил именования переменных, которым вы должны следовать:</p><ul>    <li>Имена чувствительны к регистру (month не совпадает с Month).</li>    <li>Имя начинается с буквы или знака подчеркивания, за которыми следуют буквы, цифры или знаки подчеркивания (например, user_name, score1, _count).</li>    <li>Имя не может начинаться с цифры (например, 2q недопустимо).</li>    <li>Имя не должно быть ключевым словом, зарезервированным языком (например, int, str ).</li></ul><p>Не нарушайте эти правила; в противном случае ваша программа не будет работать</p>"
      }
    ]
  }
}